service-zhwg-ywkt-mtosi-master/template/烽火/request/setTerminationPointData.xml

<?xml version="1.0" encoding="UTF-8"?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:v1="http://www.tmforum.org/mtop/fmw/xsd/hdr/v1" xmlns:v11="http://www.tmforum.org/mtop/rp/xsd/tpc/v1" xmlns:v12="http://www.tmforum.org/mtop/nrf/xsd/tpdata/v1" xmlns:v13="http://www.tmforum.org/mtop/fmw/xsd/nam/v1" xmlns:v14="http://www.tmforum.org/mtop/nrb/xsd/lp/v1" xmlns:v15="http://www.tmforum.org/mtop/fmw/xsd/gen/v1">
   <soapenv:Header>
        <v1:header>
         <v1:security>${#Project#security}</v1:security>       	
	    <v1:communicationPattern>SimpleResponse</v1:communicationPattern>
	    <v1:communicationStyle>RPC</v1:communicationStyle>  
      </v1:header>
   </soapenv:Header>
   <soapenv:Body>
 <v11:setTerminationPointDataRequest>
         <!--Optional:-->
         <v11:tpData>
            <v12:tpRef>
               <!--Zero or more repetitions:-->
               <v13:rdn>
                  <v13:type>MD</v13:type>
                  <v13:value>1</v13:value>
               </v13:rdn>
                <v13:rdn>
                  <v13:type>ME</v13:type>
                  <v13:value>7e37eb46-28ed-49d2-b6bd-1254ddfce272</v13:value>
               </v13:rdn>
                <v13:rdn>
                  <v13:type>PTP</v13:type>
                  <v13:value>/rack=1/shelf=1/slot=34/port=12</v13:value>
               </v13:rdn>
                               <v13:rdn>
                  <v13:type>CTP</v13:type>
                  <v13:value>/och=1</v13:value>
               </v13:rdn>
            </v12:tpRef>
            <!--Optional:-->
            <!--Optional:-->
            <v14:transmissionParametersList>
               <!--Zero or more repetitions:-->
               <v14:transmissionParameters>
                  <!--Optional:-->
                  <v14:layerRate extension="?">LR_OCH_Transport_Unit_2</v14:layerRate>
                  <!--Optional:-->
                  <v14:parameterList>
                     <!--Zero or more repetitions:-->
                     <v15:nvs>
                        <v15:name>SMTrailTraceActualDAPITx</v15:name>
                        <v15:value>12345678911234Z</v15:value>
                     </v15:nvs>
                  </v14:parameterList>
                  <!--Optional:-->
                  <v14:vendorExtensions>
                     <!--You may enter ANY elements at this point-->
                  </v14:vendorExtensions>
               </v14:transmissionParameters>
            </v14:transmissionParametersList>
         </v11:tpData>
      </v11:setTerminationPointDataRequest>
   </soapenv:Body>
</soapenv:Envelope>